Repository: open-dynaMIX/picompress
Catalog: src/picompress/po/*/picompress.sh.po
Languages: de

source: Usage: $0 [OPTIONS] Optional arguments: -h Show this help message and exit -d Print debug-messages
de: Benutzung: $0 [OPTIONS] Optionale Argumente: -h Zeige diese Hilfe und schliesse -d Zeige debug-Informationen

source: $directory is not a directory!
de: Der Ordner $directory existiert nicht!

source: Couldn't find $2.\nYou need to install it to use $APPNAME.
de: $2 konnte nicht gefunden werden.\nEs muss installiert sein, um $APPNAME zu benutzen.

source: Choose a folder with image-files:
de: Wähle ein Verzeichnis mit Bilddateien:

source: Choose the quality of the image-files in %:
de: Wähle die gewünschte Qualität der Bilddateien in %

source: $APPNAME - Compression
de: $APPNAME - Kompression

source: There are $picfilescount image-files in $directory.\nDo you want to shrink or rename them?
de: Es befinden sich $picfilescount Bilddateien in $directory.\nMöchtest du sie schrumpfen oder umbenennen?

source: Enter the target-size of the images in pixel or in percent. Enter 100% to keep the actual size. The ratio of the images will stay the same. Examples: Width in pixels: 120 Heigth in pixels: x120 Width & heigth in pixels: 120x120 Percent: 50% Default is 100%
de: Wähle die gewünschte Grösse der Bilddateien in Pixel oder Prozent. Gebe 100% ein, um die aktuelle Grösse beizubehalten. Das Verhältnis der Bilddateien wird beibehalten. Beispiele: Breite in Pixel: 120 Höhe in Pixel: x120 Breite & Höhe in Pixel: 120x120 Prozent: 50%: Default ist 100%

source: $APPNAME - Image-size
de: $APPNAME - Bildgrösse

source: You need to enter a value in percent or pixels!
de: Du musst einen Wert in Prozent oder Pixel angeben!

source: $APPNAME - Error!
de: $APPNAME - Fehler!

source: Do you want to rename the images, according to the timestamp in the EXIF-header (the time you've taken the picture)?\nThis works only for \*.jpg-files.
de: Sollen die Bilddateien entsprechend ihrer Zeitstempel im EXIF-Header (die Zeit der Aufnahme des Fotos)? Dies funktioniert nur für *.jpg-Dateien.

source: $APPNAME - Rename images
de: $APPNAME - Bilder umbenennen

source: %H Hour in 24-hour format (00 - 23) %j Day of year as decimal number (001 - 366) %m Month as decimal number (01 - 12) %M Minute as decimal number (00 - 59) %S Second as decimal number (00 - 59) %w Weekday as decimal number (0 - 6; Sunday is 0) %y Year without century, as decimal number (00 - 99) %Y Year with century, as decimal number\n If there is no Timestamp in the EXIF-header, the timestamp of the file will be used.
de: %H Stunde im 24-Stunden-Format (00 - 23) %j Tag des Jahres als Dezimalnummer (001 - 366) %m Monat als Dezimalnummer (01 - 12) %M Minute als Dezimalnummer (00 - 59) %S Sekunde als Dezimalnummer (00 - 59) %w Wochentag als Dezimalnummer (0 - 6; Sonntag ist 0) %y Yahr ohne Jahrhundert als Dezimalnummer (00 - 99) %Y Yahr mit Jahrhundert als Dezimalnummer (2014)\n Sollte kein Zeitstempel im EXIF-header gefunden werden, wird der Zeitstempel der Datei verwendet.

source: \nShrinking $pic
de: \nSchrumpfen $pic

source: \nRenaming $pic
de: \nUmbenennen $pic

source: \nCopying $pic
de: \nKopieren $pic

source: $APPNAME\n\nChoose a folder with \*.jpg- and/or \*.png-files to process.
de: $APPNAME\n\nWähle einen Ordner mit \*.jpg- und/oder \*.png-files, die du bearbeiten möchtest.

source: directory is already set.
de: Pfad wurde bereits gesetzt.

source: The folder $directory contains no \*.jpg- or \*.png-files.
de: Das Verzeichnis $directory enthält keine \*.jpg- oder \*.png-Dateien.

source: Your settings won't change anything on the images!
de: Deine Einstellungen bewirken gar nichts!

source: There are no *.jpg-files in $directory.\nRenaming only works on them!
de: Das Verzeichnis $directory enthält keine *.jpg-Dateien.\nNur diese können umbenannt werden.

source: One or more error(s) occured:\n
de: Mindestens ein Fehler ist aufgetreten:\n

source: # Image $fileof of $picfilescount was processed.
de: # Bild $fileof von $picfilescount wurde bearbeitet.

source: $picfilescount image-files are about to get shrinked and/or renamed.
de: $picfilescount Bilddateien werden geschrumpft oder umbenannt.

source: $picfilescount image-files were successfully processed.\nDo you want to shrink or rename other images?
de: $picfilescount Bilddateien wurden erfolgreich bearbeitet.\nMöchtest du weitere Bilder geschrumpft oder umbenannt werden?

source: $APPNAME - Success!
de: $APPNAME - Erfolg!
